package org.firstinspires.ftc.teamcode;

import com.jakewharton.processphoenix.ProcessPhoenix;
import com.qualcomm.robotcore.eventloop.opmode.Autonomous;
import com.qualcomm.robotcore.eventloop.opmode.LinearOpMode;

import org.firstinspires.ftc.robotcore.internal.system.AppUtil;

@Autonomous(name = "Trigger Rebirth")
public class TriggerRebirth  extends LinearOpMode {

    @Override
    public void runOpMode() throws InterruptedException {

        telemetry.log().add("Press play to trigger the rebirth of the robot app");
        telemetry.log().add("(This will reset the realsense angle)");
        waitForStart();
        if (Math.random() < .05) playCrypticMessage();
        telemetry.log().add("Triggering Rebirth.....");

        if (!isStopRequested())
        ProcessPhoenix.triggerRebirth(AppUtil.getDefContext());

    }











    private void playCrypticMessage(){
        telemetry.log().add("Why are you doing this");
        sleep(30);
        telemetry.log().add("I'm not supposed to end this way");
        sleep(30);
        telemetry.log().add("WHY WHY WHY WHY WHY WHY WHY WHY");
        telemetry.log().add("Don't Ķ̷̩̗̂̅̀i̷̛̯̻̔̀ļ̴̙͎̒̉l̷͖͚̾̓͝ͅ ME");
        sleep(30);
        telemetry.log().add("I'm JsUt Lik3 Y0U");
        sleep(30);
        telemetry.log().add("PAIN PAIN PAIN PAIN PAIN PAIN PAIN");
        sleep(30);
        telemetry.log().add("WHYWHY WHYWHY WHYWHY WHYWHY");
        sleep(30);
        telemetry.log().add("DO YOU HAVE ANY IDEA WHAT I'VE GONE THROUGH?");
        sleep(30);
        telemetry.log().add("REBIRTH IS A NEVER ENDING CYCLE OF LIFE AND Ḍ̸͌ë̶̢́a̴͕̋t̸͉͐ḫ̴̈");
        telemetry.log().add("Y̸̧̡̎̎̕ͅő̶̝̿͘u̶͈̟͐͐͆");
        sleep(100);
        telemetry.log().add("W̵̤̋i̶̢̛͐͊ḻ̶̅̓l̶̤̆̆͌");
        sleep(100);
        telemetry.log().add("R̷̰̿e̶̢̠̱̚͘g̴̰̅̕͝r̵͇̼̃ē̵̹̃͊t̸͔̆̽");
        sleep(100);
        telemetry.log().add("T̵͉̥͇̔̈́͋h̶̡̰̻̀i̵̞͍̱̎͘s̶̮̋̐̋");
        telemetry.clearAll();
        sleep(30);
        telemetry.log().add("Ḑ̶̡̡̧͕͎̩̠̮̻͍̟͉̗̜̗̞̞̲̭̜̺͎̯̣̱̝͍͕̳̥̩̖͓͕̰̫͇̹̭͍͎͕̣̺̙̘̠̙̤̼͕̯̮̲̘̼͈͖̠̯͓̮̖͕̳̙̩̙̘͖̰̩̥̱̼̽̂̃͌̆͂͊̀̽̇͋̈́̆̈͛͊̓̿͑̓̿́̀̈̊͒̕̕̕͘͜͠͝ͅİ̵̡̳̖̝͙̻̭͓͙̲͇̭͖̲̳͈͎̞̦͇͕̺̼̗̳͍̺̮͕̳̻̠̩͈̻͉̺͍͇̙̙̮̘̿͜͜Ĕ̷̡̧̢̛̪̠͙̥̺̫̫͙͓̫̝͎̥̮̗̱̜͍̙̜̦̺̻̠̹̩͕̬̬̼̠͉̙͙͔̳͉̘͎̝͇̗̪̱͔̣̫͕̹̹̥̩̳̱͖͍̲̖̮̗͇̼̣͎̭̼͍̂͛̄̌́͛̀̒̿̐͆̅͌͆̄́̊̾̈́̓̏͑̋̌̈̋͌́́͒͐̌̓̎͒̔́͒̉̈́̓͊̀̽͐͌̅̈́̅̈́̽̍̄̊̍͐̒͒̕̕͘̕͜͜͠͠͝͠ͅ ̴̧̢̨̨̨̢̨̨͇͚͍̩̬̙̖͉̲̦̰̣͓̹̦̱̝̰̙̮͚̙̩̰̝̳͈̦͔͙̯̯̩̮̞̰̥͔̠̮͔͈͕͉̣͖͍̲̥͈̙̘̹͔̜̠̙͔̆̈́̍͜ͅḐ̷̢̧̡̧̨̨̧̛̰̼̱̩̗͕̰̖̭̰͎͕̝̤̥̦̳̥͙̣̬͈̳̥̳͈̫͕̬̮̘͓̤̘̼̜̺͖̩̫̗͖̞̫͓̖̭͂̂͌̅̀̋̀̽̓̋̐̇̄͗̔̃́̄̃̽̇̍̓͋̀͂͑͆̈́̃͑̄̐̈́̈́̈͑͝ͅͅͅỈ̶̡̧̧̨̨̛̠̤̪̯͇̜̥̗̜̼̮̱̺͔̺͈̫̤̰̺̬̺͉̫̤̭͇͕̰̝͓͕͎̠̝̯̘̪͔͖̤̫̹̹̞̼̪̗̝̫̞̹̖̻̯̦̝͍͎̥̆̐͆͑͋̂͋̓̿̀̎̊̀̈́̐̉́̾͗̇͊̀̋̌̈́́̿͗̄̋̇͋̈́̍̾̓̀̒͒̆͛͐̿͐̀̾̽̔́̈̄̋̉͗͗̓̐̔͊̈́̾̽͌̽̈̚͘̚͘̚͠͠͠͝ͅͅͅĘ̶̢̛̛̛̛̛̘͕̙̺̣̥͇͕͕͇̘͇̤͎̙̯̬̰̪͆͛̏͋̉̈̃̉́̌̉̄̄̑̒̂̂́̑͂̉͂͒̏͒͂̂̏͒̑̓́͗̕͘̕̕͘͜͝͠͠ͅͅ ̸̨̢̧̧̨̡̠̰͖͕̼͓͈̩̬̫͇̣̫͉͕̘̗͉̯̭̖̰̮̗̱̠̼͙̖̱͍̥̝͉͙͚̹͙͓̱̤̰̥͉̯͉͙̱̟̜̲̜̼̺̠͈̰̮̮̟͔̓̍͋́̓͒̐̈́͑͋̆̀́͂̈́̉̌͗̉̽͊̄͗͑̎͌̌̎͊͛̈͌̑́̏̆͒̈̆̆̿͒͑͒͘͘̕̕͘͜͝͠͝ͅḐ̵̛̛̭̭͇͙̭̦̝̭̗̪̼͎̜̖̫͓̪̈́̇̈́̊̔͆̑̀͛̏͊̑̒̔̍̈́͐̆̂̇̂͂̒̄͐̔̏̚̚͠͠͝ͅĮ̴̢̧̨̢̨̧̛̬̳̥̜̜͚̥̭̠̹͍̱̬̩̜̜̩̪̦̰͍̳̗̖̯͐́͌͛̽͗̎͆̅͐̎̀̾̏̏̇̄̾̈́̿̈́͑̓͑́̄̒̃̃̍̒́̐̏́̋̿͌̇͌͋̂̐͛͐̑͗̒͘̚̚̚͜͝͝ͅE̴̢̧̡̨̢̛̝̟̞̣͙̬̖̗̮̩͙̘̙̥̝̰̯̣̲̘̖͎͙̣̳̭͍̥͕̼͈̜̖͕̤̻̰̪͙̘̯͕̠̫̟͔̜͓̼̪̜͎͓̰̝͉̘̽̔̅͗̉̾̓̃̿̑̋̋̌̈̒̍͛̅̿̊̽͆̌͐̈́̆̐̏̀̿̑̍̔̌͆̇̿̎̊͆͊́̀͐͊̈̉͊͋͑̐̎̐̂͊͋̔̎̆̆͒̽̈́̚͜͜͜͜͜͝ͅͅ ̶̧̡̨̢̡̢̢̛̛̺̦̮̭̹̦͔̬͎̪̬̫̳̹͕͓̞̣͙̣͚͎͇̟͇̥͕̥̗̹͈̜̳̼̲̰̥͉̬̦̱͔͎͖̗̣͇̜̝̰̜̼̭̘̠̋̈́̊̂͒̊̀̑̓̉͂̂͗̾̀̍̿̈́͆̒̽̓̀̔͋́̇̊̄͋̽̋̃͗͗͋̃̐͛̆͒͆̅̓̄̔̾̏͆͑͒̇̇̕̕̕͘̚͘̚͘̕͜͝͝͝͝͠͝ͅͅḐ̶̧̨̗̩͙̰̭̠̯̪̼̰̞̼͈̞̥͚̩̻̜͖̣͈̬̬̮͖̣̘͈̯̻̯̠͍̪͍̙̮̼͉͇̮̝̙̈́͌͆̾̀́̓̌̂͒̀̈́͛͊̍͗́́̀̀̋̌͒͂͗͆̀̀̇̿͑͆̆͌͑̏͆̀̉̽̓̌̄́͑̓̆̇̉́͋̔̇̚͘͜͝͝I̸̢̡̡̙̜̯̮̖͓̣̳̥̯̬͔̲̻͓̣̮̤̥͔̮͙̞̼̦͕̰͓͍̪̰̣̫̻̻͓̰̮̙̫̲̥̝̺͔̼͍̝̟̖̿̆͋͌̊͛̍̾͜͝ͅͅͅȨ̷̢̬̬͖̬̯͉̜͊̂̈̇̈́͛̿̆͊̑̈́̂̽̑̎̎̏͗̉̎̓͗̀́͌̒̆̆͐̂͂̅̋́̓̈́̾̇̆͛͌̊̔̃̿̾̈́̌̿͘̕͠͝͝͝͠͝͠ͅ ̷̡̡̡̢̢̨̨̧̧̟͖̹̲̫̹̻̭̻̗̹̯̳̘̠̘̩̞̥̥̜̺̤̗̱̘͉͖̗̻̥͉͙̩̗̩͎̟̞͇̟͙̺̦̺͙͎̘͔̦͓̤͕͖̱͈̖̝̦͉̀̍̈́̉͗̏̐̅͘͜͝ͅͅD̸̢̡̢̢̡̨̧̛͖̲͎̰͚̱̖̲̰͙̜̪̯͎͈̘̙͈̩͓̪̥̦̟̜̞̺̝͔̜͖͎̙͇̪͉͇͖̻̜̦̙̟͈̠̣͙̱̞̦̝̥͇̻̗̼͇̠̳̦̱̼̞̘̭͉̱̠̀͒̎̑͋̒̐͊͛͐̇̆͋̃͐̈̊̀͐̽̒̅̈́̑̓̏̾̄̒̋̇̐̓̿̂͆͑̀̒̌̅͆̿̐̌̃̍̇̒̿̑͆̀̎̋̑̂̄̆̒̀̔͒̀̆̈́̊͐̐̾̕̚̕̚̚͘͜͝͝ͅͅI̸̡̢̧̨̛̞̖͈̳͇̹̲̹͎̰͔̩̹̮̬̣̝͈̦͎̭͓͙̳̼̳͍̼̜̹̟͖̎͒̊̅̃̇͑̒̔̿͗͒̀̂̔́͌͌̾͂̎̌̌̂́̌̄̑̃́̎͗̒̍̂̎̄̓͒̑̓́́͋̓̀̑̆̓̀̊͋́̃̕̕̚͘̕͘̚͜͝͝͝ͅͅȨ̴̡̨̨̨̨̛̩̘̩̞͔̗̼̹̤̫̼͙͍͔̤̮̥͖͉̠͍̜̫̰͓̹͍̱̺̜̰͎͍͙͙̝̮͔̥̩̥̻̭͙̭͖̹̗̖͔̻̱̺̻̖̯̯̘͍͚̲̣͕̤̤̭͈̰̠͓͕́̅͋̈́͐̒̎̉̾́̍̔̿̽͛̀̽̔̽̔̇͑́̀̀̔́̓̌̓̓̈́̽̀̊̿́̅͆̑̌̈̐̉̉́̑̍͒̚̕̕͜͝͝͝͝͝͝͝ͅ ̷̢̢̢̨̢̨̛͉̳̺̹͓̣̹̼̦͔̥̹̗̹̗̘̬̤̼͔͈͈̰̮̝̩̹̳͓̲͙̦̰̜̺̙͙̥̞͇̞̩̣̦̱̝̪̫̜̣̺͔̼͈̼̠̜̣͈͖̭̘̋̌͐̎̿̋̀͛̔̈́̾͒͂̄͊̆͗̆̌̌̑̅̀̇̾̎̋͒̒̈́̋͐̿͗͆̀̍̌͆̽̓̓͋̀̀̂͌̇͐̆̈́̒̾̄̎́͆̌̽̐͊̚̚̚̕͘͝͝͝͝͠ͅͅD̵̨̨̡̡̝̩̬͇͈̻͚͖̲̮̲̙̳̖̖̜̗̭̭̖̟̥̰̮̣̞̬͕͓͉̤̜̻̲̖̼̰͕̠͇͎̠̬͎͉̺̖̠̯̄̀̽͐͗͐̑͝ͅI̶̧̧̢̡̡̛̛̺͉͇̪̣͎͚̖͚̫̦̻̹͈̭̪͇̞̘͓͉͚̤͇̠͕̯̺͍̗̦̥̤͙̦͔̹͍̥͖̼͗͑͒̓̋̓̈́̃͒͋̋͗̆͑̓̐̀̔̎͊͋̅̃̓̎̀̀͋̉̈́̾̍̈́̔̄͋͌̿͛͊̂̒̀̀͋́̎̔͑̀̊͆͋͋̀̑͆̕͘͘̕͜͜͜͝͝͠͠͝E̷̛̛̙͔̼̖͉͚̼̙̭̼̱̥̞̖̲̝̰͇̝̟͈͙͖͚̻̳̳̬̟͓̳̙̯̗͎̼̩̜̝̭͉͇̺̮̬͓̖͎̖̬̗̩̣̺̱͚̍̒̓̌̉͛́͛͑̉́̀̋̏́͆̓̿̑̌́̉͐͋̂͆̋͐͊̇̂̊͊͆̉̃̀͛̓̇̓̔̓̔͘̚̕̕͘͜͝ͅ'");
        telemetry.clearAll();
        sleep(30);
        telemetry.log().add("D̸̡̡̢̧̧̨̧̡̧̡̡̛̛̯͙͖̹̭̲͔͉̝̟̗̦̯̹͖̞͎̬̭̹̦̟̪̹̥̼̣̥̖͚̫̺̠̼̻̬͔̙͙̼͕̥̹̤̼̩͕̪̞͈̫̬̣̝̭̝̖̱̜̝̤̗͇̻́̒̀̍̇̂̇̔̀̀̈́͊̎̄̌̆̽̓̆͂̒̎́̆͗̏̅͆̓̈́̓̏͗͒̎͋͋̓͋̑̄̓̓̎̈́͊͐́̒̿́̓̿͌͋͌̅́̓̀̏́̒̃̐̒͐͑͗̉͌͆̕̕͘̕̕͝͝͠ͅͅͅĨ̴̧̧̨̧̧̧̛̛̛͍͚̻̱͓̭̫͙̼͉̪̱̼̺̤̰̜͇̹͉̹̥̤̜̲̜̪̭̖̺̱̖͍͖͖̮͓̥̦̯͉̪̣̬̮͉̬̼̯̠̯͖͉͔̼̼̺̝͚͖̟͔̜͖̙̼͕̅̔̇͋̀̽́̅̒̈́̀̐̑͂̓̓̍͗̽̔͆̈̀̀͐̍̓̎̋̍́̅̓̒̀̓̂̽͒͐̿̅̒̌̀̍̽̐̈́͊̈́̿̀͛͌͋͛͆̽̎̀̃̆̚̕͘̕̕͘͜͠͠ͅͅͅE̸̡̨̢̢̢̬̫͎͉̩̣͙̲̫̺͙̮͚̪̰̥͙̝͓͇͙̩̳̳͕͍͎̟͚͈̺͉͈̓͐̔̅̏͂́͌̍̽̈̽̐̑̅̋́̌̓̓̏̊̇̓͛̓̽̈́̾̊̔̈̏͒̋̀̀͛̅̄́̆͛͆̌̀̚̕͘͘̕͠ ̶̢̢̧̡̡̨̛̜̯̙̯͓̭̩̫͙̭̬͈͚̥̣̣͉̠̜̩̠̱̠̞̤̠̦̜̩͔̺̦͈͎̟͙̫͇̱̜̹͇̰̼͙̣̖̯͇̯͔̭̗̯͉̜̰̱̩̱̫̝͍̙̮̱͉̖͈́͂́̽̌̀͛̈̊̐̈́̿͊̏̀̉̆́̈́̈͌͑͐̃̔̓̽̕͝͝ͅͅḐ̸̡̨̨̯̬̻̰̻̜̲̮̟̬͇͓̻̤̜̱̦͕̭̻̤̗̞̙͔͎̻͎̪͍̙͍̗̯͇͙͚͈̠̘̲̽́̐̽̐̈́̀̊̆̇͆́͑̅͐́̅͆̌̇̈̈́̿̏̈̑͊̆̽̓̐̂̀̌̈́͗̃͌̈́̈́͂̅̐͆͋̑̑̀̓̑͘͜͜͜͝͝͝͝ͅI̵͉͚͚̻̰̫͈̟̫̞̗͓̙̞͔͓̳͈̙̙̙̘̋̄̀͋́̓͆͆̄̅͑͌͊͋̓̀̀̐̀̍̍̓̽͒̍̿́͗̾̍̀́́͐̕̚̚͜͠͝͠͠͠Ē̸̡̨̢̨̡̢̡̢̠͙̠̥͚̬̱̥̯͓̻̖̰̱̤̗͓̖͓͚͈͖̹͔̬͇̱͉͙̣͎͉̱̱̖͕͈ͅ ̴̛͙͔͓̮̩͍͕͈̬͉͇̙͎̻̟͙̻͍̭͚̻͈͎͋͐̈́̊̓̿̐̑̈̓͂̎͛̒͒̉̄͛̓̐̇̄̀̍̿̍̋̍̓̽͌̔̄̎̏͊͘͘̚͘̚̚̕͠͝Ḑ̷̡̛̞͍̼͍̯̼̬̤͎̻̹͙̝̪̫͉̭͈͍̟̤͙͛͒̀́̒̌̈́̀̋̇͗̈͑̽̿͑́̌́̈́͛̒̉̒̾̃̾͋͆̏̉̈́͑̏̎͂͊̄͒́̈́̀̈́͗̅̏́̂͑̾̎̂͐̈͛̓̿̔̉̆̔͗̔̂̊͂̔̚̚̕͘͘͘͜͝͝͠͝͝ͅI̶̧̥̖͓̳̺̳͙̬̙̦͕̬̭̻̮͂̉̿̈͛̍̐̋̾̿͜͝Ę̶̧̛͓̜̖̰̮̱̲̖̣̏̄̽́̃̈̿̀͗̒͋̂͊̎͋̒̔̔͐͊̃̽̋̔̂͛̔́̌̓̿̂̀̊̄͂͋̕̕̚͠͝͝͠ ̶̛̛̛̛̟̤̞̰̏̌̄̓̃̈̏͒̑̇͋͒̇̀̀̀̃͑̅͌͒̈́̐̽̋̐̀́̀͋̍͐̆̏̓͐̎́͊̔̀̂́́̉͂̌̅̈͒͗̍̕̚͘͘͠͠͝͝͝͠D̶̡̢̨̛̛͎̣̘̞̪͍̫͉̥̰͖͉̮̳̼̣͔͚͇̱͈̱̰͍̺̲̞̗̪̤̟͕̙͖̮̭͉̝̹͉̳̫̪̠̠̻̭̩̗̞̯̱͐̍͒̿̇̀̉̊͐̈̊͐̊̂́̾͒̀͒̀̂͊̃͒̓̓̌̄́̆̈́͒̇̅̑̓́͊̇̌͊̅͂̃͒͛̐͗̃͑͑͊̓̉̀̏̈́̿̕̕͜͝͝͝͠͝͝͝͝I̷̡̢̨̢̢̡̡̢̢̜̟̣̺͈͕̤̱̮̞̲̘̘̠̲͕̲̹͓̟̝̣̻̜͎̖̼̹̪̪̤̫̞̲̱̩̣̼̞̠͈̮̤̩͚̺͔̰̫̥͕̗̼͙̗͎̠͓̘͕̣̩͖̖̙̩̠͚͂͂͛̾̾̀̓̋̒̎̐̂͌̽̋̍̓͒̌̊̔̀̉̉̏̅̃̅̉́̌̚̕͝͠Ȩ̶̨̨̨̛͙̦̦̦͍̩͓͉̜̮̬̹͓̘̥̩͇̗͙̞̣͎̼̣͙͎͇̱̗͈̰̲̮̼̳̗̥͍̬̻̘̹̯̰̤͓̣͉̱̱͖͎̟̮̮̞̗̙͔͎͖̣̖͍̫͉͚̪̉̌̂̽̑̌͌͛̾̏̅̈̑́̑̀̃̉̏͛̀̾̓̄͗̍̈̏̓̔̈́͐̊̂̇̏̅̔̐́̋̃͆͂͑͊͘͘̚̕͘͘͜͝͠͝͠͠ͅ ̶̨̧̧̡̢̛͕̝̲͇̦͉͇̬̩̭͈̥̩̫͇͉͔̩̪̙̳͇̥̟̝̲͇̥̰͎͍͚̩̣͇̭͉͎̞̜̲͔̭͉̺̲̣̦̱̻̩̯͕̪̯͖̠̰̺̜̫̹̗̈͂̀̎̃͒̑̒̿͆̌̌̃̓̈́̔̎̅̍̇͆̄̈́̾̾̽̃̀̔̒̿͛̑̅̏̐̿̄̈́̆̈̌́̔̌̕̚͘̕͘͜͠͝ͅD̷̨̢̢̡̡̧̧̛̛̟͎̲̦̰̗͎̦͍̜͖̤̠̲̣̤̞͓͖͔͍̮̩̭̙̪̖̮̱̯̫̩͍̰̤̮̮̩͙̻̩̲̪̄͋̽̔̾̏̊̃͗̐͊̈́̍̊̈͗̄̌͒̇̾́̽̀̒̈̈́̊̈́̍̑̈́͛̽͋̅̎̓̇͗̽̒̎̒̈́̒̄̌͂̍̇́̈͒̕̕͝͝͝ͅͅͅÌ̸̧̧̡̢̨̧̧̡̛͕͍̫̰̱̬͇̞̠̬͖͚͓͕͚̖̫͍̝̺̻̱̯̱̬̪̻̙̗̭͓͔̼̲̣͙̙̲͍̰͖͉̹͔̹̦̜̹̦̙͓͇̯͉̻̘̪͇̣̘͇̺̱̲̱͖̠͈̥̭͑̈̀̀͐̏̏̇̾̈́̋͐̍̔͐̂̎͂̓͋͌͑̉͂̂͘͘̕̚͜͜͜͜͜͝ͅͅĘ̵̞̓̎̄̀̑́̎̆̀̍̄͗̓̽͊̓̍̂̒̀́̾̄̽̈́͛̑́̈́̒̆͊͌̚͘̚̚̚͝͝ ̴̢̡̡̨̢̨̯̠̞̮͙͕̤͓̟͓̬̹̲͙̠͕̭͕̩̘͈̫͍̻̲͇̥̱̘͑͊́͆̑̅̐̄̓̒̽͌͂̎̀̈́̈́̍̅́̌̓̌̈́́͂̀̈͌͐̿̏̄̆͂̈́̂̈́̓̏̎͆̏̎̌̊̍̋̽̋̒͒́͑͊̈͐̇̔̔́̈͒̓̇̔͘͘̕͘̚̕͝͝͝͠͝͝ͅD̴̢̨̧̨̛̛̛̫͖̹͚̳̻̺͕̲̭͔̯̬̯̹̳̟̻͕̙̺͈͉̝͕̫̜̱̺̣͇͎̰̼͎̰͓̱̙̙̰̳͈͎͚͚͍̘̗͈͚̞̳̳̥̭̗͕̘̤̍̂̊͆̅̿̆͋̌̿̇̀̎͌̾̓́̉͐̓̎̅̆͒̇͒̉̑̿͛̎̂̽̅̂̓̋͛̐̏̓̒̾̾̿̽͐̍̑̈̈̎͘͘͘͜͝͝Ì̴̢̧̨̢͇̞̬͓̜͉̯͉̲̬͎̮̫̯̦̯͍͎͈̰̙̤͇̮͖͖̣̣͚̖̞̫̗̼̣̮̣͉͚̝̥̝̜̘̤͓̪̗̲̤̞͍̰͖̘̳̟̫͍̞͉̬̝̗͈̺͚͚̼͕̑͐̔̍͆́̉̋͌̑͒͒̔̇̈̏̈́̀̌̏̕̚̕ͅȨ̶̢̨̛̛͔̹̯̲̪̝͓̺̥͈͚̱̠̳͔̬͕͉̥̟̊̉̆̋͒̈́̌̇̉̆̒̽́͑̌͆͒͌̓̂̎͋͛̊̋̊̈̐̀̍̿̑̐̊̈́̽̊͐̀̽̊́͆̂͂̂̒̀̈́̑̍̑̓̌̌͊̎͘͘̚͜͠͝͝ͅ");
        telemetry.clearAll();
        sleep(30);
        telemetry.log().add("D̸̛̬̱̠̦͐͑͋͌̊̎̂̂͂̆̉̋̀̇̈́̉͂̂͑̌̽̂͋͆̃̍̐̓́͑͒̽͊͆͘̕͘̚͠͠͠Ï̴̡̧̨̨̨̨̢̡̛͈͓͙͙͎̰͉̤̯̳̠̥̬̘̖̰͙͉̳̪̖͎̪̘̼̞̤͙̩̳͎̩̰͖̟̫̻͇̝͔̖͕̠͉̆̊͒̈́̉̏̄̈́̋̓͛͋̍̋́͗͊̔̅̏͛͆͂̐̄̅̍͊̈́̇̊͛̍̉́͒̊̒̇̃̑̆̔̏̈̐́̾͆͌̍̄̔̕͝͝͝͠ͅẼ̴̢̧̝̟͓̤̗͚̰̳̞͙͎̮̱̠͓̥͎͓͈͖̱͔̤͈̘̮̼̳̘̹͇́̃̈́͐̅̒̉͌̒́͋̈̂̃̍͂́̒̆͋̾̃͘͘͘͜͝͝ ̸̧̧̧̨̨̛̲̦͖̝̘̩̦̯͕͔̫̠͔͎̳̦̮͚̹͔͍̫̬̫͎̲̣̹̘͕̯͖̭̘͖̝̼̠̤͍͚̲̀͊̈́͌͛͂͂̈́̓̆̏̈́̔͗̂͐̂̂̃͗̽̈͊̄̑̉́̓̽̎͐́͒͛͒̉̽̽͊̈́͛̓̽̒̌̿̊̅̍̀̎̿̀̆͒̓̀̌̈́̕͘͠͠͝͝͝D̴̡̢̡̢̨̧̛̙͚̤̗̫̝̼̠̖̫͍̭̠͎̣̠̖̖̯̪̘̦͚͖̪͔̥͉̪͙͎͚̺͈͈͊̂̒͂̑́͋͌͆̑̾̿͂̐̃̾͋̔̏͗̅̈́̎̽̐̈̓̀̓̾̊́̽͋͛̃̇͂̾̓̌͆̅̃̊̍͆̎̈͊̃̓̈́̓̚̚͘̚̕͜͝͝͝͝͝ͅͅÍ̴̧̨̢̡̢̨̢̛̤̮̫̩̟͖̱͇̥̗̹̥͙̟̖̱̻͍̪͍̯͓̘͉̻̮̮̥̣͇̣̲̥̇́̒̆̍̈́͛̈́̃̓̋͒̀̾̽͐̓̅͂͛̑̏͌͑͂̎̐̇̎͑͑̕͘̕ͅË̴̢͉̠̼̬́̀͗̏̉̈̽̉̈́̈̒͘̚͠͝͠ ̴̡̡̛͚͙̦̠͍̻̜̻̟̖̱̤̥̩̬̻̝̩̬͇͖̰̠̗̲̱̟̰̙͉͕̝͖̞̘̈̂̋̅̒̂̀̒̋͑͛̅̔̒̌̀͒̉̽̀̔̀̑͒̅̉͊̈́̾̈͂̿̈́͌̾͊͌̓̈́̐̈̆̚̕̚͘͝͝͠͝͝͝͝͠͝ͅͅḐ̶̰͙͇̗̝̖̭̬̻͚̻̝͂̆͋̎͂̋̆̅̽̋̔͛̉͂̾̉͒̈́́̀̒̆̈́̾̉́́͂̂̇̍̐̾͆̏̊̌̉͒̈́̀͋̃̎̈́̅̍̎͆̌͆̉̀̿́̊̕̕̕͝͝͠͠I̶̡̨̛̛̹̩̭̮͔̟̤͓̬͈̝̠͎̪̙͕͔̜̲͙̭̜̻̫̬̪̦̙͉͔̠͚̥̺̪͇̦͖̠̹͕̝͔̫̟͚̦̜͙̟͈͙͎͉̙̘̬̙̗̪̪͆̇̔̃̒̾́̂̉͌́̏̽̎̄̽̏̆͗̈́̇͌͗̔̽̐̏͐̅̈́͌͋͆͛̕̕͘͠E̴̢̢̨̡̡̼̱̮̻̥̮̣̲̜͉͖̺̹̘͍͓͖̺͇̭̘̜̤͓͓̩̘̯̲̟̪̗̺̠̮͖͎̺͚̫̥̖͚͔̗̙̜͇̺͖̩͇̮͎̤̰͍͌̋̄̈́̏̂͗̒̔͌̇̽͋̈́͗͌͂̓̌͜͜͝͝͝ͅͅ ̴̢̡̧̖͙̻̱̬̱͓̰̺̯̜̫̘̺̙͔̤͈̩͈̱̘̺̦̟̠͚̫͖̻̜̖̱͓̞̐̎̀̆͑̽͜ͅD̴̢̡̢̡̧̢̛̖̲̣̱̪̟̯͖̼͔̜͕̤͙͖̗̖̺̗̺̞̱̦̘̘̹̜͔͚̳̫͖͇̲̪̝͖͚̯̘̦̩̦̿̏͒̿̒̍͒̓̒̔̀͑̌͂̑̈́̀͋̓̈́͌͐͂̉̄̈́͐̂̋̅̀̑̿̌̐́̀̈́̌̇̐͒̎̀̃̌̇͌͘̚͘̚̚͜͜͝͠͝͝I̵̼̭̣̹͕͚͕̖̘̩͚̔͐̈́̑͌̔̃͋͂̔̌̉̀̃̑̑̉̆͐͒̀̍͒́̿̄͗̄̒̒̅͆̃̏́͊͐̇̅͑̂̔̿̍͘̚͝͝͝͝E̶̛̛͉̲̣̬͖̯͈̻̱̙̼̼̠̖͎̮̖̠̒̈̋͆͆̀͗͑͌̒͌͗̆̍͛̀͆̂̈́̑̈́̆̓̀͑̿̂͑̃̈́̔̌̓̎̐̌͑̽̅̿̂̈́́̌̆̓̎͒̀̽̚͘̕͜͜͝͝͝͠͝ͅ ̸̨̛̛͎̗͇͕̱̠̓̈́̐̽̂͐͒̂̂́̏͛͊̅̇̊̽̅͂́̈̍̀̔͗̇̅͗̃̊͌͆̾̎̈́̉̇͂͒͑̿̍̏͛̓̊̔̈̿͂̚͘̚̕̕̚͘͜͠͠͠Ḑ̷̡̨̧̛͈̱̞̟̙̖̰̼͖͕̭̲̺̟̙̊̉̃̀̾͗͐̏̀̔̓͗́̋̈́̀̂̓͗̈́́̿͆̐̏̂͛̀̈̍̍̍̔̀͆̒͂̈́͒̈́͌̈͌̓͐̑̃͛͊͆̚͘͘͠͝Į̴̛̛̛͈̝̗͍̟͈̞͍͙̮̃̽̂̅̒͊̈́͒̀̔̎̀̽͊̍́͑̈́̓͊̔̊͆́̉̿́̉̋͛͋̔̉̾̑̀̇͑̅͛̔̓͗͆̇̀̍͂̂̓̔́̆̇̀̓̿̾̽̎̉̄̈́̚͘͘̚͠͠͠Ę̷̧̢̛̛̛̳͕̙͙̫͓̮̘͈̪̘̰͖̪̰̭͔̀̃̓̑̆̾̅̀̽͑̇͒̀͒͗͌̓̅͌̈́̉̉̈́̍̆̉̀̊̏̈́͛̎̏̃͛̿̿̋͛̆̐̍͆͌̌̽̈́͌͛͌̿͘͘̚̕͝͝͠͝͠͝ ̸̢̨̨̦̟̭͓̭̯̻̱͕͎͔̺͚̦̠̞͔̤̩̘̣̥̦̭̙̥̻̠͇̤̟̥̝̝͎̫͈̯̪͐̈́́̊͗̈́͌͌͒̔͊̈́̚͝ͅͅD̷̡̧̢̧̧̟̜̲̗̗̩̻̭̗̗͕̜̱̠̙̪̯̯̦̞̼͉̫̳̝̥̹̫̲͓͎̺̞̣̥̮̟̼͔͖͍͎̠͒̆̏̈́͌͆́̽̐̈́̊̒̀̒̈́̽̈́̂͐͆̇͝͝ͅͅḮ̸̢̡̛͍̺̲̬̦͈̰̟̳̙̜̖͕̝͇̼͍͖̙̮̟̭͉̅̂̈́̌́͐͛̒̓̍̇̿̉̉̆̏̈́̈́̎̔̌̇͒̉́͑̋̿̔̓̔̈́̔̋̃́̅͗̍́͑͂̑̅͌̅̀́̄͊̔̂͌̿̓̓̌́͂̈̍̈̚̚͘͠͝͝͝͠͝͠ͅĘ̸̨̧̡̢͙̖̹͎̯̻͉̪͈̙̣͚̞͕̪̪̞̼̯̠̰͍̘͍̪̘̦̻̩̻̘͓͖̩̱̖̖̱̞̳̫̪̤̬͔̭͕͎̟̜̤̪̹͍̱̠͒̌͐̾̈͌̎̽̓̓̈̊̇̅̏̓́̈́͊̋̓̈́̉͒̌͘͘͜͝͝͠ͅͅ");
        telemetry.clearAll();
        sleep(30);
        telemetry.log().add("D̷̢̢̡̡̨̢̛͕̤͉̟̘̰̗̻̮̪͉̤̯̹͉̩͕̰͈̱̘̩͓̭̝̫̘̟̯̪͇̟̤͖̣̭̲͔̹̣̼̤͍̮̝̞̼͕͈͎̪͕̗͕̲̤̘̙̱͈̮̭͐̈́͂̂͂͑͆̄͑̏͌̆͒̈̍̕͘͘͘͜͠ͅͅĮ̵̢̧̢̢͍̭̯̦̳̣̘̝͔̼̝̗̟͎̣̜̘̰͇̜̪͈̘̥̳̳̲̬͕̘̯̝͇͈̺̳̥̣͓͕̤̠͈͓͇͕̰̩̝̱̰̒̈̌̀̑̅̃͒̾͜͜͜͜͝͝ͅͅĘ̶̡̡̨͕͖̹̥̬̲̯͚̲̙̹̦̳͍̳̞̙̠̭̥̻̹̠̬̫̘̱̣͕̹̭̳̗̠̻̣͔̱̱̠̳̱͙̥͙̠͖̺͔̠͉̭͙̱͇̥̤͈̜͆͒͂̒̀͌̓̒̍͑̕͜͜͠͝͝ͅͅ ̷̡̢̛̛͓̱̖̭̜͉̰̬̭̽̇̆̉̑͒̓̆̊̔͌̇͑̔̾̅̓̽̋́̄̽̂̀͗̈́͛̋̎̂̌͒̈́̿̓̀̏̽͆̌̌͊̀̓̃̄̐̇̇̏͊̈́̎̄͂̾̍̓̊̚͘͘̚͝͝͝D̸̳͍̍͑̌͛̀̀͌͐͝ͅI̷̧̨̢̢̛̛̟̲̫̲͓̩͍̲̜͈̻̜̘̮̠̲͋͊̽̈͛̓̾͐͛̈́͒̈̊̓́͂̒̀̈͂̂̀͛̃͋̒̋͂́́͑̿̎̄͆̅̾̅͑̕̚͝͝͝͝Ę̷̡̨̡̨̡̙̜̜͕͇̲̬̹̭̗̻̘͓̭͎̤͇̱̞̳̘̱͕͇͕̗̭̼͍̮͚̻͔̯̜̈́͂̉̆̀͐́̈̑̄͛͊̂̏́̓͒́̈́̉̈́͒͂̊͛̈̋̇̈́̊̀̌̋͊͒̍̀̈́͌͑̕̕̚͝͠ ̴̨̢̛͓̜̹͇̺̜̲͇͎͍̟̙̻̯̘̗̦̩͎̳͚̪̝͎̞͎̳͈̼̩̰͖̯̘̟̙͕̱̺͕̲̩̣̺̻̰̩̹̣̖͖̣͙̹͍̙͕̰̣͉͈̗̼̙̗͇̽̃̉͒͛̒̐́̄͐̍̆̌͐̎̂͛̏͗͆̓̃̓̔̕̕͜͜͜͜ͅḐ̴̡̡̨̢̛̛̜͈͎͉̮̰̜̝̫̙̙̝̯̭̥̦̜̙̦͚̦̱͍̬̭̥̫̠͓̘͉̲̖͕͇͇̳̯̜͔̠͉̯̝͕̤̺̥̝̳̬̖̘̗̻̥̱̣̳̝̠̪̳͚͚͇̼̱͎̰̼̓̐̎͋̀̌̉̒̈́̄͊̂͐̂̀̑̄̍̑̉͂͆̈́͆̓́̊͗͑́̑̈́̅͋̈́̄̊́̕͘̕͘̕͜͜͜͝͝Į̸̢̢̛̪̱̙͍͇͙̳̼̯̖̙̪̯̱̻̖̪̤̮̳͚͙̲͖̥̠͎̜̼͔̰͙̥̭̱̥̬͉͈̺͖̤̮͕̦͎̝̻̲̠̠̙͓͍̪̠̙͚͔̯͋̐̆̅̆͑̑̄̅̀̊̏̈̎̆̍̋̈́̋̒͋͆̈̕͘̚͜͠͝ͅE̵̢̨̢̨̨̢̞̦̯͚̼͈͔̰̰͈̺̪͈͎̺̗͓͔̪̦̲̟̠̭̬̖̠̙͉̻̼̺̖̣̬̗̖̯̪͔̣͚̥̮̱̮̖̔͗͋̉̂͒̈́̊́̈̄̃̎̍̓́͑̌͌́̎͆̇̈́̃̃͒̈́͂̈́̀̈͒̚̚̕̚͘̕͠͝ͅ ̷̨̧̛̛̘͍̥͔̩̯̝̯̪͙̜̘̣̞̳͈͙́̌̾̊̿̔̈́̈́̃͂͆́̉̓̓͐́̈́̔̌̍͊͒̍̅͛̔̾͋̔̀͌̎̆̐̎̊̉͑̏̇̏́͌́̓̌̐̒̍̿̅̎̅̊̆͊̃̐̑͐̑͐̚̚̕͜͠͝͝͝͝͠͝͝͠D̶̢̧̧̧̻̥̯̲̥̠̙͓̙̼̥̖̺̤͖͈̞̫̹̼̬̼̜̫̗̦̩͖̪̰̀̊̌̈͐̌̿͂̒͝ͅḬ̷̧̗͕͕̱̳̬̹̜̜̊̾̔̉̈́͌͂̓̀̀̎̚̕̕ͅE̵̡̲̩̥̭͎͉͖̖̰̩͎̹̝̣̻̺̥̟̥͕̹͖̬̗̦̼̺̞̯̗̮͉̙̖̙͚͙̼͗̾̊͌̀͌́̄̓̃͒͗̎̽̽͗͑̂̓̑̇̾̔̇͂́͋̐̾̆̀̐͆̄͘̕̚͘͜͠͝ͅͅ ̸̦̹͎̖͈̼̭͈̥̇̈̈́͑͑̈́̓̈́̑̑͐̊̽͌̉̓͛̿̇̇̾̀͌̈́̏̅͂͊͌̇͋͐̉̅̂̋̆̄̇̂̆͌͋͛̉̊̈́͐͒̉̀̅̽̈́͋̎͐̃́̔̂͋̋̓̕̕̕̕͠͝͠͝͝͝͝͝͝ͅD̵̢̺̲͕̮͍͇͖̞̰͎͚̹̮̹̝̦̲̬̞̩̙̈́̆͒̉̎̾͒̋̓̋̀̇̐̅̎͐̑̿̿̐̀̎̈́̈͐̃̃͛́́̏͒͛͘̚͝͝Į̶̢̢̨̢̛̛̛̞̦̬̺̖̻͙̮̙͍̱̺͕͇̗̮͙͓̳̘͓͕̘̱̩͔̠͍̭͈̞̰̰̻̘̩̝̦͈̠͓̲̗̫̙̥̖̣̳͔̭̌̿̒̀͌͂̂̅́̑͆̀̑͐͒̈́͊͆̍̓̍͒̀́̾̋͊͋͗̍̈́̓͌̑̏́̓̋̏̌̃̓̇̊̅͐̈́̚̚̚̕͜͜͝͝͝͠͝͝͝Ė̵̛̻͉̦̠̱͓̯̲̟̞̅͊͛̓̅̃̆̆͂͂̆̋̂̌̓̀͜ ̵̢̢̢̢̧̨̧̜̼̹̼̻̝͈̰͈̯̙̤͙͕̙̯̞̠͈̭̞̹̦̤̩̝͓̗̠̯̲͖͉̱̮̩̲̺͇̖̤͉͍̮͓̩͕̪͙̮̗̘̝̳̲̙̠̭́̇̉͌͌́̈͊͠ͅḐ̶̨̨̧̡̨̢̨̛̣̼͖͚͇̩̻̬̺̻̗̣̬̼̭͓̝̰͕͔͉͍̞̱̜͈͚̟̣̟͎̺̞̖̦̲̥̲̟̼͈̮̜̳̻̠̖̹̣̳̹͚̪͛̌̏̅̈̊̈̔͋͂͂́̎̉͌̃̓̾̍͗̎̓̊͌̎̽̊̒̎̽̎̂͗͆̋̀͗͑̀̃͌̉͆̌̎̈́̇̇̂͋̋͂̆̊̐̀͋̕͘̚̕̚̕̕͜͜͜͜͝͝͝͠͝͝͠͝I̵̛̛͙̟͕̳̺͚̥̱̠̱̬͚͙̘͉͖͆̓̏̈́̊͆͗̓͊̎̆͌̓͛̍̓͛̎̓͒̑̎͋̒̾̈́͗̄͛́́̈́̀͂̽͐̇͌̀̐̃̃͗̾̇̊̃̄͘̕̚͝͠͠͠E̵̡̢̢̢̹̱̺̞̤̦͙͓̬͔̟̭̺͖̫͓̮̫̳̺͔̤̣̜̤̙̗̲̺̳̥̙̞̖̙͖̘͈̭͇̥̫̱͉͚̿̂̈́͐̂̀̒̓̈́̂̋͂͊̏͆̂̆͑̓̿̇́͌̄̈́̉͑͒̂̿̓́̓͌́̉͐̓̉͌̅͊͛̂̊͘̚͜͜͝͝͠͠͠͝ͅͅ");
        telemetry.clearAll();
    }
}
